<ion-view view-title="比比旅行">
    <ion-header-bar align-title="center" class="bar-positive">
    <div class="title" style='font-size: 1.6rem;'>
        <span class="heaTxx">关于我们</span>
        <a class="returnbut c_fff returnjs" style='font-size: 1.6rem;' ng-click="back();"><span></span>返回</a>
    </div>
</ion-header-bar>
<ion-content class="aboutus-content">
    <!----关于我们----------->
    <section class="wrap_Box  bg_f6f6f6 aboutUs">
        <section class="aboutus_ctn bg_fff border_t_1_e9 mt_100 pa_100">
            <p class="lsjt_icon mb_100"><img src='<?php echo base_url("resources/air/image/us_logo.png"); ?>'></p>
            <p class="nsubix_box c_181818 f_s12 text_a_c mb_100"><span class="bg_fff pl_100 pr_100">生于航旅 4年蜕变 2012-2016</span></p>
            <h2 class="f_s16 c_181818 mb_55">深圳航旅投资发展有限公司</h2>
            <p class="f_s14 c_181818 mb_100">创始人兼CEO李东方先生 </p>
            <p class="f_s14 c_999 mb_55">于2012年6月创建，初始注册资金500万。是一家集国内、国际机票、酒店预定、旅游咨询等于一体的综合电子商务企业。</p>
            <p class="f_s14 c_999 mb_55"><span class="c_181818 mr_100">5C 拥有五中心</span>航旅联盟B2B电子商务中心，产品研发中心，400call-center、支付中心，比比旅行OTA事业中心， 属深圳市内销售范围较广、服务规模较大、综合实力较强的大型民航服务企业。</p>
            <p class="f_s14 c_999 mb_55"><span class="c_181818 mr_100">5V 拥有5优势</span>“全网价格最低优势，实时票务高准确度60秒内预定出票，7*24H贴心客服，全民合伙人旅游电商体系优势，全平台航班酒店资讯整合优势”。</p>
            <p class="f_s14 c_999 mb_55">2012年6月  取得国际航协一类代理人牌照<br/>2013年4月  取得中国航协二类代理人牌照<br/>2014年10月 取得“阿里旅行”平台供应商合同<br/>2015年03月 取得“携程旅行”平台供应商合同<br/>2015年06月 取得“去哪儿网”平台供应商合同<br/>2015年10月 取得“同程旅行”平台供应商合同<br/>2015年11月 取得“小米MIUI生态系统”供应商合同<br/>2016年5月  取得“途牛旅行”平台供应商合约</p>
            <p class="f_s14 c_999 mb_55">2013-2014年，公司分别获得中国航协二类代理牌照、国际航协一类代理牌照。通过差旅管家业务，奠定企业发展基础。</p>
            <p class="f_s14 c_999 mb_55">2014-2015年，成立航旅联盟B2B电子商务中心，陆续取得阿里旅行 携程旅行 去哪儿网 同程旅行 大型供应商合同，年度营收为6亿元。</p>
            <p class="f_s14 c_999 mb_200">我们经过2015年全年的B2B电商平台布局，根据月实际交易量推算， 2016年度仅B2B事业部营收总额确可达到25亿元。</p>
            <p class="nsubix_box c_181818 f_s14 text_a_c mb_100"><span class="bg_fff pl_100 pr_100">铸就深圳最大OTA服务平台</span></p>
            <p class="f_s14 c_181818 mb_100">蜕变 企业未来成长价值</p>
            <p class="f_s14 c_999 mb_100">深圳航旅投资发展公司，企业在职人员76人，业务快速扩张，各部门正逐步增加优秀人才加入团队，16年度将扩充为100人规模。将从单纯的大型票务酒店供应商，蜕变为旅游服务生活平台，这里不但有快速低价的精准出票系统，还有风尚旅游定制化航旅特色服务，更是贴近每位热爱旅游人士的社交乐园，打造属于年轻人的吃喝玩乐UGC社区。比比旅行，更加垂直，更加专注，更加自由。</p>
            <p class="f_s14 c_181818 mb_100">全球定位，以航旅为入口,构建互联网旅游生态链 </p>
            <p class="f_s14 c_999 mb_100">“比比旅行”的核心在于以【分享·社交·群组】概念打通流量入口的创新点，其以 “分享短视频，图文游记”、“定制出游群组社交”的形式激发用户决策，从而获取流量和忠实用户。比比旅游拥有专业摄制组团队和旅游策划团队，深入在每个目的地拍视频出游专题栏目，类似”爸爸去哪了”从特色住宿、当地美食、探秘体验、生活家访谈等多个维度进行展示。后期将联合优酷、爱奇艺、乐视、腾讯等视频网站以及微信同步推广，从而吸引精准用户关注。 以代

                UGC的模式，逐渐带动客户UGC社群，组团定制行程，金融借贷，航旅票务，完成旅游闭环。比比旅行目的在于完善旅游行业中用户对“社交+出游+金融”的生态需求。通过大数据抓取所有国内航空公司数据+四大平台数据+国际航司数据，提供最快速、最精确、最低价的机票，并以此为切入点，打通了ugc旅游社区科普、咨询、消费出游、行程问答、资金借贷、游记采编这一完整闭环，解决了用户不知道如何选择适合自己的出游路线、出游航班、酒店、导游，和周边消费概况等用户痛点。比比的航班C2C

                海淘形式的海外代购产品“BEEgoal”更是解决了商家于C端用户之前的权利不对称，uber的C2C模式，开启了用户与用户之间直接下单买卖的新高度，让共享经济进一步巩固。 </p>
            <p class="f_s14 c_181818 mb_100">万商云集，万客于此，比比旅行共舞于斯！ </p>
            <p class="f_s14 c_999 mb_100">一个融“研发 • 航旅 • 金融 • 电商 • 品牌孵化“多功能于一体、具有【最快速订出票】、【最全面价格信息查询】、【最稳妥贴心服务】美誉的“比比旅行APP“暴风袭来！ </p>
            <p class="f_s14 c_181818 mb_55">未来  一个共生的平台</p>
            <p class="f_s14 c_181818 mb_100">未来  一个共赢的时代</p>
            <p class="f_s14 c_999 mb_100">合作企业：深圳航旅投资发展有限公司</p>
            <p class="f_s14 c_999 mb_100">【中国顶级航旅运营商】<br/>Cooperative enterprise：Shenzhen Aviation Inve stment Development Co., Ltd. <br/>mob：18665995871 <br/>tel:  0755-83984059</p>
            <p class="f_s14 c_999 mb_55">【品牌企业鼎力相助，高端行业标杆酝酿聚合效应】</p>
            <p class="f_s14 c_999 mb_100">品牌商：携程、去哪儿、阿里旅行、同程网、三板虎</p>
            <p class="f_s14 c_999 mb_55">【比比旅行】的文化理念是——</p>
            <p class="f_s14 c_999 mb_100">“科技就要创芯，创造就要领悟，创‘芯’才能领先”</p>
        </section>
    </section>
    <!----关于我们  [end]----------->
</ion-content>
</ion-view>