<?php

if (!defined('BASEPATH'))
    exit('No direct script access allowed');

/*
 * 订单状态
 */
$config['订单状态'] = array(0 => '等待付款', 1 => '等待处理', 2 => '开始处理',
    3 => '出票完成',
    4 => '暂停出票',
    5 => '无法出票',
    6 => '订单超时',
    7 => '订单关闭',
    8 => '订单失败',
    9 => '锁单',
	10 => '退款完成'
);

/*
 * 保险订单状态
 */
$config['保险订单状态'] = array(0 => '待支付', 1 => '支付成功，待处理', 2 => '处理中',
    3 => '投保成功',
    4 => '支付成功，投保失败',
    5 => '订单取消(机票订单取消)',
    6 => '手工取消订单',
    7 => '订单创建失败',
    8 => '申请退保,待处理',
    9 => '投保处理中',
    10 => '退保成功,已退款',
    11 => '退保成功,未退款',
    12 => '投保失败,退款成功',
    13 => '取消订单',
    14 => '无法退保',
    15 => '订单关闭'
);

/**
 * 飞机 航程旅客状态
 */
$config['航程旅客出票状态'] = array(
    0 => '出票中',
    1 => '已出票',
    2 => '改签中',
    3 => '已改签',
    4 => '退票中',
    5 => '已退票',
    6 => '无法出票',
    7 => '已关闭',
    8 => '已取消',
    9 => '无法改签',
    10 => '用户取消改签',
    11 => '无法退票'
    );
	
/*
 * 保险类型
 */
$config['保险类型'] = array(0 => '航空意外险', 1 => '交通工具险', 2 => '延误险');

/*
 * 注册来源
 */
$config['注册来源'] = array(0 => 'weixin', 1=>'');
/*
 * 出票状态  订单表
 */
$config['出票状态'] = array(0 => '出票中', 1 => '已出票', 2 => '用户申请退票',
    3 => '正在退票',
    4 => '已退票',
    5 => '无法退票',
    6 => '用户申请改签',
    7 => '正在改签',
    8 => '已改签',
    9 => '无法改签',
    10 => '无法出票'
);

/*
 * 退票状态  退票表
 */
$config['退票状态'] = array(0 => '用户申请退票', 1 => '正在退票', 2 => '已退票',
    3 => '无法退票'
);

/*
 * 改签状态  改签表
 */
$config['改签状态'] = array(0 => '用户申请改签', 1 => '正在改签', 2 => '已改签',
    3 => '无法改签'
);

/*
 * 证件类型
 */
$config['证件类型'] = array(0 => '身份证', 1 => '护照', 2 => '其他证件');

/*
 * 火车证件类型
 */
$config['火车证件类型'] = array(1 => '一代身份证', 2 => '二代身份证', 3 => '港澳通行证',
    4 => '台湾通行证',
    5 => '护照',
);

/*
 * 支付方式
 */
$config['支付方式'] = array(0 => '支付宝', 1 => 'QQ钱包', 2 => '微信支付');

/*
 * 产品类型
 */
$config['产品类型'] = array(0 => '国内机票', 1 => '国际机票', 2 => '保险',
    3 => '报销',
    10 => '火车票',
    11 => '火车票保险',
    12 => '火车票报销'
);

/*
 * 改签
 */
$config['申请状态'] = array(0 => '客户提交申请', 1 => '处理申请', 2 => '生成改签订单',
    3 => '客户支付改签订单',
    4 => '改签成功',
    5 => '无法改签',
    6 => '申请关闭'
);

/*
 * 保险 产品类别
 */
$config['产品类别'] = array(0 => '航意险', 1 => '交通工具险', 2 => '延误险');

/*
 * 保险 保险期限
 */
$config['保险期限'] = array(0 => '当次航班', 1 => '七天有效');

/*
 * 保险 结算方式
 */
$config['结算方式'] = array(0 => '当次', 1 => '月结');

/*
 * 接口的配置文件
 */
$config['conf'] = array(
    // 深圳凯亚
    'Agency' => 'szhltz', 'Security' => 'szhltz', 'Path' => 'register', 'Url' => 'http://218.17.237.38:8233/receiver-2.0/',
    // 51 book
    'Agency51Book' => 'szxhlv', 'Security51Book' => '!RNWQ)F6', 'Url51Book' => 'http://ws.51book.com:8000/ltips/services/',
    // 阿里大鱼短信
    'AliDayuURL' => 'https://eco.taobao.com/router/rest', 'AliDayuKey' => '23341419', 'AliDayuSecret' => '0220203b8335451c88ef9e216db8be95'
    );

/*
 * 机场
 */
$config['机场'] = array('AEB' => '百色','ACX' => '兴义','AKA' => '安康','AAT' => '阿勒泰','AXF' => '阿拉善左旗','AOG' => '鞍山','AQG' => '安庆','AVA' => '安顺','AKU' => '阿克苏','BGF' => '班吉','BFJ' => '毕节','BPL' => '博乐','BAV' => '包头','BHY' => '北海','BSD' => '保山','BPX' => '昌都','CMJ' => '七美','CYI' => '嘉义','CIF' => '赤峰','CNI' => '长海','CGQ' => '长春','CZX' => '常州','CGO' => '郑州','CSX' => '长沙','CAN' => '广州','CTU' => '成都','CIH' => '长治','CHG' => '朝阳','CGD' => '常德','CKG' => '重庆','DAT' => '大同','DLC' => '大连','DQA' => '大庆','DCY' => '稻城','DLU' => '大理','DIG' => '香格里拉','DSN' => '鄂尔多斯','DDG' => '丹东','DOY' => '东营','DYG' => '张家界','DAX' => '达州','DNH' => '敦煌','EJN' => '额济纳旗','ERL' => '二连浩特','ENH' => '恩施','ENY' => '延安','FUG' => '阜阳','FOC' => '福州','FUO' => '佛山','FYN' => '富蕴','GNI' => '格林岛','GYS' => '广元','GXH' => '夏河','GOQ' => '格尔木','GYU' => '固原','HCN' => '恒春','HUN' => '花莲','HDG' => '邯郸','HET' => '呼和浩特','HRB' => '哈尔滨','HSN' => '舟山','HFE' => '合肥','HJJ' => '怀化','HSC' => '韶关','HMI' => '哈密','HLD' => '海拉尔','HLH' => '乌兰浩特','HEK' => '黑河','HIA' => '淮安','HYN' => '黄岩','HGH' => '杭州','HUZ' => '惠州','HAK' => '海口','HZH' => '黎平','HZG' => '汉中','HTN' => '和田','IQN' => '庆阳','INC' => '银川','IQM' => '且末','JNZ' => '锦州','JMU' => '佳木斯','JUZ' => '衢州','JUH' => '池州','JGS' => '井冈山','JIU' => '九江','JHG' => '西双版纳','JGN' => '嘉峪关','JXA' => '鸡西','JGD' => '加格达奇','JJN' => '晋江','JDZ' => '景德镇','JNG' => '济宁','JIQ' => '黔江','JZH' => '九寨沟','JIC' => '金昌','KHH' => '高雄','KNH' => '金门','KHN' => '南昌','KWL' => '桂林','KJH' => '凯里','KRL' => '库尔勒','KHG' => '喀什','KCA' => '库车','KOW' => '赣州','KGT' => '康定','KWE' => '贵阳','KMG' => '昆明','KJI' => '喀纳斯','KRY' => '克拉玛依','LLV' => '吕梁','LDS' => '伊春','LCX' => '连城','LJG' => '丽江','LXA' => '拉萨','LYG' => '连云港','LYI' => '临沂','LYA' => '洛阳','LLF' => '永州','LZH' => '柳州','LZO' => '泸州','LLB' => '荔波','LNJ' => '临沧','LUM' => '芒市','LZY' => '林芝','LHW' => '兰州','MFK' => '马祖','MFM' => '澳门','MZG' => '马公','MXZ' => '梅县','MIG' => '绵阳','MDG' => '牡丹江','NZH' => '满洲里','NBS' => '长白山','NDG' => '齐齐哈尔','NTG' => '南通','NNG' => '南宁','NAO' => '南充','NKG' => '南京','NGB' => '宁波','NNY' => '南阳','NGQ' => '阿里','NLT' => '那拉提','OHE' => '漠河','PIF' => '屏东','PZI' => '攀枝花','PEK' => '北京','NAY' => '北京','RMQ' => '清泉岗','RHT' => '阿拉善右旗','RKZ' => '日喀则','RLK' => '巴彦淖尔','SJW' => '石家庄','SZX' => '深圳','SYX' => '三亚','SHP' => '秦皇岛','SHE' => '沈阳','SHA' => '上海','PVG' => '上海','SWA' => '揭阳','SUN' => '遂宁','SYM' => '普洱','TNN' => '台南','TPE' => '台北','TTT' => '台东','TVS' => '唐山','TGO' => '通辽','TNA' => '济南','TEN' => '铜仁','TCZ' => '腾冲','TLQ' => '吐鲁番','TPE' => '台北','TSN' => '天津','TYN' => '太原','TNH' => '通化','TXN' => '黄山','TAO' => '青岛','THQ' => '天水','TCG' => '塔城','TSA' => '松山','UYN' => '榆林','URC' => '乌鲁木齐','WOT' => '望安','WUS' => '武夷山','WEF' => '潍坊','WEH' => '威海','WXN' => '万县','WNH' => '文山','WUA' => '乌海','WUX' => '无锡','WNZ' => '温州','WUH' => '武汉','WUZ' => '梧州','XIL' => '锡林浩特','XUZ' => '徐州','XFN' => '襄樊','XIC' => '西昌','XNT' => '邢台','XMN' => '厦门','XIY' => '西安','XNN' => '西宁','YIE' => '阿尔山','YTY' => '扬州','YIW' => '义乌','YNT' => '烟台','YIH' => '宜昌','YZY' => '张掖','YIN' => '伊宁','YCU' => '运城','YNJ' => '延吉','YNZ' => '盐城','YIC' => '宜春','YBP' => '宜宾','YUS' => '玉树','ZHA' => '湛江','ZQZ' => '张家口','ZUH' => '珠海','ZYI' => '遵义','ZAT' => '昭通','ZHY' => '中卫','FYJ' => '抚远','HXD' => '海西','HPG' => '神农架','AHJ' => '阿坝','HNY' => '衡阳','LPF' => '六盘水','HCJ' => '河池','WDS' => '十堰');
//$config['机场'] = array('AEB' => '百色','ACX' => '兴义','AKA' => '安康','AAT' => '阿勒泰','AXF' => '阿拉善左旗','AOG' => '鞍山','AQG' => '安庆','AVA' => '安顺','AKU' => '阿克苏','BGF' => '班吉','BFJ' => '毕节','BPL' => '博乐','BAV' => '包头','BHY' => '北海','BSD' => '保山','BPX' => '昌都','CMJ' => '七美','CYI' => '嘉义','CIF' => '赤峰','CNI' => '长海','CGQ' => '长春','CZX' => '常州','CGO' => '郑州','CSX' => '长沙','CAN' => '广州','CTU' => '成都','CIH' => '长治','CHG' => '朝阳','CGD' => '常德','CKG' => '重庆','DAT' => '大同','DLC' => '大连','DQA' => '大庆','DCY' => '稻城','DLU' => '大理','DIG' => '香格里拉','DSN' => '鄂尔多斯','DDG' => '丹东','DOY' => '东营','DYG' => '张家界','DAX' => '达州','DNH' => '敦煌','EJN' => '额济纳旗','ERL' => '二连浩特','ENH' => '恩施','ENY' => '延安','FUG' => '阜阳','FOC' => '福州','FUO' => '佛山','FYN' => '富蕴','GNI' => '格林岛','GYS' => '广元','GXH' => '夏河','GOQ' => '格尔木','GYU' => '固原','HCN' => '恒春','HUN' => '花莲','HDG' => '邯郸','HET' => '呼和浩特','HRB' => '哈尔滨','HSN' => '舟山','HFE' => '合肥','HJJ' => '怀化','HSC' => '韶关','HMI' => '哈密','HLD' => '海拉尔','HLH' => '乌兰浩特','HEK' => '黑河','HIA' => '淮安','HYN' => '黄岩','HGH' => '杭州','HUZ' => '惠州','HAK' => '海口','HZH' => '黎平','HZG' => '汉中','HTN' => '和田','IQN' => '庆阳','INC' => '银川','IQM' => '且末','JNZ' => '锦州','JMU' => '佳木斯','JUZ' => '衢州','JUH' => '池州','JGS' => '井冈山','JIU' => '九江','JHG' => '西双版纳','JGN' => '嘉峪关','JXA' => '鸡西','JGD' => '加格达奇','JJN' => '晋江','JDZ' => '景德镇','JNG' => '济宁','JIQ' => '黔江','JZH' => '九寨沟','JIC' => '金昌','KHH' => '高雄','KNH' => '金门','KHN' => '南昌','KWL' => '桂林','KJH' => '凯里','KRL' => '库尔勒','KHG' => '喀什','KCA' => '库车','KOW' => '赣州','KGT' => '康定','KWE' => '贵阳','KMG' => '昆明','KJI' => '喀纳斯','KRY' => '克拉玛依','LLV' => '吕梁','LDS' => '伊春','LCX' => '连城','LJG' => '丽江','LXA' => '拉萨','LYG' => '连云港','LYI' => '临沂','LYA' => '洛阳','LLF' => '永州','LZH' => '柳州','LZO' => '泸州','LLB' => '荔波','LNJ' => '临沧','LUM' => '芒市','LZY' => '林芝','LHW' => '兰州','MFK' => '马祖','MFM' => '澳门','MZG' => '马公','MXZ' => '梅县','MIG' => '绵阳','MDG' => '牡丹江','NZH' => '满洲里','NBS' => '长白山','NDG' => '齐齐哈尔','NTG' => '南通','NNG' => '南宁','NAO' => '南充','NAY' => '北京','NKG' => '南京','NGB' => '宁波','NNY' => '南阳','NGQ' => '阿里','NLT' => '那拉提','OHE' => '漠河','PIF' => '屏东','PVG' => '上海','PZI' => '攀枝花','PEK' => '北京','RMQ' => '清泉岗','RHT' => '阿拉善右旗','RKZ' => '日喀则','RLK' => '巴彦淖尔','SJW' => '石家庄','SZX' => '深圳','SYX' => '三亚','SHP' => '秦皇岛','SHE' => '沈阳','SHA' => '上海','SWA' => '揭阳','SUN' => '遂宁','SYM' => '普洱','TNN' => '台南','TPE' => '台北','TTT' => '台东','TVS' => '唐山','TGO' => '通辽','TNA' => '济南','TEN' => '铜仁','TCZ' => '腾冲','TLQ' => '吐鲁番','TPE' => '台北','TSN' => '天津','TYN' => '太原','TNH' => '通化','TXN' => '黄山','TAO' => '青岛','THQ' => '天水','TCG' => '塔城','TSA' => '松山','UYN' => '榆林','URC' => '乌鲁木齐','WOT' => '望安','WUS' => '武夷山','WEF' => '潍坊','WEH' => '威海','WXN' => '万县','WNH' => '文山','WUA' => '乌海','WUX' => '无锡','WNZ' => '温州','WUH' => '武汉','WUZ' => '梧州','XIL' => '锡林浩特','XUZ' => '徐州','XFN' => '襄樊','XIC' => '西昌','XNT' => '邢台','XMN' => '厦门','XIY' => '西安','XNN' => '西宁','YIE' => '阿尔山','YTY' => '扬州','YIW' => '义乌','YNT' => '烟台','YIH' => '宜昌','YZY' => '张掖','YIN' => '伊宁','YCU' => '运城','YNJ' => '延吉','YNZ' => '盐城','YIC' => '宜春','YBP' => '宜宾','YUS' => '玉树','ZHA' => '湛江','ZQZ' => '张家口','ZUH' => '珠海','ZYI' => '遵义','ZAT' => '昭通','ZHY' => '中卫','FYJ' => '抚远','HXD' => '海西','HPG' => '神农架','AHJ' => '阿坝','HNY' => '衡阳','LPF' => '六盘水','HCJ' => '河池');
$config['airport_short'] = array('AEB' => '巴马机场','ACX' => '兴义机场','AKA' => '五里铺机场','AAT' => '阿勒泰机场','AXF' => '巴彦浩特机场','AOG' => '腾鳌机场','AQG' => '天柱山机场','AVA' => '黄果树机场','AKU' => '阿克苏机场','BGF' => '班吉机场','BFJ' => '飞雄机场','BPL' => '阿拉山口机场','BAV' => '二里半机场','BHY' => '福成机场','BSD' => '云瑞机场','BPX' => '邦达机场','CMJ' => '七美机场','CYI' => '嘉义机场','CIF' => '玉龙机场','CNI' => '大长山岛机场','CGQ' => '龙嘉机场','CZX' => '奔牛机场','CGO' => '新郑机场','CSX' => '黄花机场','CAN' => '白云机场','CTU' => '双流机场','CIH' => '王村机场','CHG' => '朝阳机场','CGD' => '桃花源机场','CKG' => '江北机场','DAT' => '云冈机场','DLC' => '周水子机场','DQA' => '萨尔图机场','DCY' => '亚丁机场','DLU' => '大理机场','DIG' => '迪庆机场','DSN' => '伊金霍洛机场','DDG' => '浪头机场','DOY' => '胜利机场','DYG' => '荷花机场','DAX' => '河市机场','DNH' => '敦煌机场','EJN' => '桃来机场','ERL' => '赛乌苏机场','ENH' => '许家坪机场','ENY' => '二十里堡机场','FUG' => '西关机场','FOC' => '长乐机场','FUO' => '沙堤机场','FYN' => '富蕴机场','GNI' => '格林岛机场','GYS' => '盘龙机场','GXH' => '甘南机场','GOQ' => '格尔木机场','GYU' => '六盘山机场','HCN' => '恒春机场','HUN' => '花莲机场','HDG' => '邯郸机场','HET' => '白塔机场','HRB' => '太平机场','HSN' => '普陀山机场','HFE' => '新桥机场','HJJ' => '芷江机场','HSC' => '桂头机场','HMI' => '哈密机场','HLD' => '呼伦贝尔机场','HLH' => '乌兰浩特机场','HEK' => '黑河机场','HIA' => '涟水机场','HYN' => '台州路桥机场','HGH' => '萧山机场','HUZ' => '平潭机场','HAK' => '美兰机场','HZH' => '黎平机场','HZG' => '西关机场','HTN' => '和田机场','IQN' => '庆阳机场','INC' => '河东机场','IQM' => '且末机场','JNZ' => '小岭子机场','JMU' => '东郊机场','JUZ' => '衢州机场','JUH' => '九华山机场','JGS' => '井冈山机场','JIU' => '庐山机场','JHG' => '嘎洒机场','JGN' => '嘉峪关机场','JXA' => '兴凯湖机场','JGD' => '加格达奇机场','JJN' => '泉州机场','JDZ' => '罗家机场','JNG' => '曲阜机场','JIQ' => '武陵山机场','JZH' => '九寨黄龙机场','JIC' => '金川机场','KHH' => '国际机场','KNH' => '台湾机场','KHN' => '昌北机场','KWL' => '两江机场','KJH' => '黄平机场','KRL' => '库尔勒机场','KHG' => '喀什机场','KCA' => '龟兹机场','KOW' => '黄金机场','KGT' => '甘孜机场','KWE' => '龙洞堡机场','KMG' => '长水机场','KJI' => '布尔津机场','KRY' => '克拉玛依机场','LLV' => '吕梁机场','LDS' => '林都机场','LCX' => '冠豸山机场','LJG' => '三义机场','LXA' => '贡嘎机场','LYG' => '白塔埠机场','LYI' => '沭埠岭机场','LYA' => '北郊机场','LLF' => '零陵机场','LZH' => '白莲机场','LZO' => '蓝田机场','LLB' => '荔波机场','LNJ' => '临沧机场','LUM' => '德宏机场','LZY' => '米林机场','LHW' => '中川机场','MFK' => '马祖机场','MFM' => '国际机场','MZG' => '马公机场','MXZ' => '长岗岌机场','MIG' => '南郊机场','MDG' => '海浪机场','NZH' => '西郊机场','NBS' => '长白山机场','NDG' => '三家子机场','NTG' => '兴东机场','NNG' => '吴圩机场','NAO' => '高坪机场','NAY' => '南苑机场','NKG' => '禄口机场','NGB' => '栎社机场','NNY' => '姜营机场','NGQ' => '昆莎机场','NLT' => '新源机场','OHE' => '古莲机场','PIF' => '屏东机场','PVG' => '浦东机场','PZI' => '保安营机场','PEK' => '首都机场','RMQ' => '台湾机场','RHT' => '阿右旗机场','RKZ' => '和平机场','RLK' => '天吉泰机场','SJW' => '正定机场','SZX' => '宝安机场','SYX' => '凤凰机场','SHP' => '山海关机场','SHE' => '桃仙机场','SHA' => '虹桥机场','SWA' => '潮汕机场','SUN' => '遂宁机场','SYM' => '思茅机场','TNN' => '台南机场','TPE' => '桃园机场','TTT' => '台东机场','TVS' => '三女河机场','TGO' => '通辽机场','TNA' => '遥墙机场','TEN' => '凤凰机场','TCZ' => '驼峰机场','TLQ' => '交河机场','TPE' => '桃园机场','TSN' => '滨海机场','TYN' => '武宿机场','TNH' => '三源浦机场','TXN' => '屯溪机场','TAO' => '流亭机场','THQ' => '麦积山机场','TCG' => '塔城机场','TSA' => '台北机场','UYN' => '榆阳机场','URC' => '地窝堡机场','WOT' => '望安机场','WUS' => '武夷山机场','WEF' => '潍坊机场','WEH' => '国际机场','WXN' => '万州五桥机场','WNH' => '普者黑机场','WUA' => '乌海机场','WUX' => '苏南硕放机场','WNZ' => '龙湾机场','WUH' => '天河机场','WUZ' => '长洲岛机场','XIL' => '锡林浩特机场','XUZ' => '观音机场','XFN' => '襄阳刘集机场','XIC' => '青山机场','XNT' => '褡裢机场','XMN' => '高崎机场','XIY' => '咸阳机场','XNN' => '曹家堡机场','YIE' => '伊尔施机场','YTY' => '泰州机场','YIW' => '义乌机场','YNT' => '莱山机场','YIH' => '三峡机场','YZY' => '甘州机场','YIN' => '伊宁机场','YCU' => '运城机场','YNJ' => '朝阳川机场','YNZ' => '南洋机场','YIC' => '明月山机场','YBP' => '菜坝机场','YUS' => '巴塘机场','ZHA' => '湛江机场','ZQZ' => '宁远机场','ZUH' => '金湾机场','ZYI' => '新舟机场','ZAT' => '昭通机场','ZHY' => '沙坡头机场','FYJ' => '抚远机场','HXD' => '德令哈机场','HPG' => '神农架机场','AHJ' => '红原机场','HNY' => '南岳机场','LPF' => '月照机场','HCJ' => '金城江机场','WDS' => '武当山机场');
$config['airport'] = array('AEB' => '百色巴马机场','ACX' => '兴义机场','AKA' => '安康五里铺机场','AAT' => '阿勒泰机场','AXF' => '巴彦浩特机场','AOG' => '鞍山腾鳌机场','AQG' => '安庆天柱山机场','AVA' => '安顺黄果树机场','AKU' => '阿克苏机场','BGF' => '班吉机场','BFJ' => '毕节飞雄机场','BPL' => '博乐阿拉山口机场','BAV' => '包头二里半机场','BHY' => '北海福成机场','BSD' => '保山云瑞机场','BPX' => '昌都邦达机场','CMJ' => '七美机场','CYI' => '嘉义机场','CIF' => '赤峰玉龙机场','CNI' => '长海大长山岛机场','CGQ' => '长春龙嘉国际机场','CZX' => '常州奔牛机场','CGO' => '郑州新郑国际机场','CSX' => '长沙黄花国际机场','CAN' => '广州白云国际机场','CTU' => '成都双流国际机场','CIH' => '长治王村机场','CHG' => '朝阳机场','CGD' => '常德桃花源机场','CKG' => '重庆江北国际机场','DAT' => '大同云冈机场','DLC' => '大连周水子国际机场','DQA' => '大庆萨尔图机场','DCY' => '稻城亚丁机场','DLU' => '大理机场','DIG' => '迪庆香格里拉机场','DSN' => '鄂尔多斯伊金霍洛机场','DDG' => '丹东浪头机场','DOY' => '东营胜利机场','DYG' => '张家界荷花国际机场','DAX' => '达州河市机场','DNH' => '敦煌机场','EJN' => '额济纳旗桃来机场','ERL' => '二连浩特赛乌苏机场','ENH' => '恩施许家坪机场','ENY' => '延安二十里堡机场','FUG' => '阜阳西关机场','FOC' => '福州长乐国际机场','FUO' => '佛山沙堤机场','FYN' => '富蕴机场','GNI' => '格林岛机场','GYS' => '广元盘龙机场','GXH' => '甘南夏河机场','GOQ' => '格尔木机场','GYU' => '固原六盘山机场','HCN' => '恒春机场','HUN' => '花莲机场','HDG' => '邯郸机场','HET' => '呼和浩特白塔国际机场','HRB' => '哈尔滨太平国际机场','HSN' => '舟山普陀山机场','HFE' => '合肥新桥国际机场','HJJ' => '怀化芷江机场','HSC' => '韶关桂头机场','HMI' => '哈密机场','HLD' => '呼伦贝尔海拉尔机场','HLH' => '乌兰浩特机场','HEK' => '黑河机场','HIA' => '淮安涟水机场','HYN' => '台州路桥机场','HGH' => '杭州萧山国际机场','HUZ' => '惠州平潭机场','HAK' => '海口美兰国际机场','HZH' => '黎平机场','HZG' => '汉中西关机场','HTN' => '和田机场','IQN' => '庆阳机场','INC' => '银川河东国际机场','IQM' => '且末机场','JNZ' => '锦州小岭子机场','JMU' => '佳木斯东郊机场','JUZ' => '衢州机场','JUH' => '池州九华山机场','JGS' => '井冈山机场','JIU' => '九江庐山机场','JHG' => '西双版纳嘎洒国际机场','JGN' => '嘉峪关机场','JXA' => '鸡西兴凯湖机场','JGD' => '加格达奇机场','JJN' => '泉州晋江机场','JDZ' => '景德镇罗家机场','JNG' => '济宁曲阜机场','JIQ' => '黔江武陵山机场','JZH' => '九寨黄龙机场','JIC' => '金昌金川机场','KHH' => '高雄国际机场','KNH' => '台湾金门机场','KHN' => '南昌昌北国际机场','KWL' => '桂林两江国际机场','KJH' => '凯里黄平机场','KRL' => '库尔勒机场','KHG' => '喀什机场','KCA' => '库车龟兹机场','KOW' => '赣州黄金机场','KGT' => '甘孜康定机场','KWE' => '贵阳龙洞堡国际机场','KMG' => '昆明长水国际机场','KJI' => '布尔津喀纳斯机场','KRY' => '克拉玛依机场','LLV' => '吕梁机场','LDS' => '伊春林都机场','LCX' => '连城冠豸山机场','LJG' => '丽江三义机场','LXA' => '拉萨贡嘎机场','LYG' => '连云港白塔埠机场','LYI' => '临沂沭埠岭机场','LYA' => '洛阳北郊机场','LLF' => '永州零陵机场','LZH' => '柳州白莲机场','LZO' => '泸州蓝田机场','LLB' => '荔波机场','LNJ' => '临沧机场','LUM' => '德宏芒市机场','LZY' => '林芝米林机场','LHW' => '兰州中川机场','MFK' => '马祖机场','MFM' => '澳门国际机场','MZG' => '马公机场','MXZ' => '梅县长岗岌机场','MIG' => '绵阳南郊机场','MDG' => '牡丹江海浪机场','NZH' => '满洲里西郊机场','NBS' => '长白山机场','NDG' => '齐齐哈尔三家子机场','NTG' => '南通兴东机场','NNG' => '南宁吴圩国际机场','NAO' => '南充高坪机场','NAY' => '北京南苑机场','NKG' => '南京禄口国际机场','NGB' => '宁波栎社国际机场','NNY' => '南阳姜营机场','NGQ' => '阿里昆莎机场','NLT' => '新源那拉提机场','OHE' => '漠河古莲机场','PIF' => '屏东机场','PVG' => '上海浦东国际机场','PZI' => '攀枝花保安营机场','PEK' => '北京首都国际机场','RMQ' => '台湾清泉岗机场','RHT' => '阿右旗巴丹吉林机场','RKZ' => '日喀则和平机场','RLK' => '巴彦淖尔天吉泰机场','SJW' => '石家庄正定国际机场','SZX' => '深圳宝安国际机场','SYX' => '三亚凤凰国际机场','SHP' => '秦皇岛山海关机场','SHE' => '沈阳桃仙国际机场','SHA' => '上海虹桥国际机场','SWA' => '揭阳潮汕机场','SUN' => '遂宁机场','SYM' => '普洱思茅机场','TNN' => '台南机场','TPE' => '桃园机场','TTT' => '台东机场','TVS' => '唐山三女河机场','TGO' => '通辽机场','TNA' => '济南遥墙国际机场','TEN' => '铜仁凤凰机场','TCZ' => '腾冲驼峰机场','TLQ' => '吐鲁番交河机场','TPE' => '桃园国际机场','TSN' => '天津滨海国际机场','TYN' => '太原武宿国际机场','TNH' => '通化三源浦机场','TXN' => '黄山屯溪机场','TAO' => '青岛流亭国际机场','THQ' => '天水麦积山机场','TCG' => '塔城机场','TSA' => '台北松山机场','UYN' => '榆林榆阳机场','URC' => '乌鲁木齐地窝堡国际机场','WOT' => '望安机场','WUS' => '武夷山机场','WEF' => '潍坊机场','WEH' => '威海国际机场','WXN' => '万州五桥机场','WNH' => '文山普者黑机场','WUA' => '乌海机场','WUX' => '苏南硕放国际机场','WNZ' => '温州龙湾国际机场','WUH' => '武汉天河国际机场','WUZ' => '梧州长洲岛机场','XIL' => '锡林浩特机场','XUZ' => '徐州观音机场','XFN' => '襄阳刘集机场','XIC' => '西昌青山机场','XNT' => '邢台褡裢机场','XMN' => '厦门高崎国际机场','XIY' => '西安咸阳国际机场','XNN' => '西宁曹家堡机场','YIE' => '阿尔山伊尔施机场','YTY' => '扬州泰州机场','YIW' => '义乌机场','YNT' => '烟台莱山国际机场','YIH' => '宜昌三峡机场','YZY' => '张掖甘州机场','YIN' => '伊宁机场','YCU' => '运城机场','YNJ' => '延吉朝阳川机场','YNZ' => '盐城南洋机场','YIC' => '宜春明月山机场','YBP' => '宜宾菜坝机场','YUS' => '玉树巴塘机场','ZHA' => '湛江机场','ZQZ' => '张家口宁远机场','ZUH' => '珠海金湾机场','ZYI' => '遵义新舟机场','ZAT' => '昭通机场','ZHY' => '中卫沙坡头机场','FYJ' => '抚远机场','HXD' => '德令哈机场','HPG' => '神农架机场','AHJ' => '阿坝红原机场','HNY' => '衡阳南岳机场','LPF' => '六盘水月照机场','HCJ' => '河池金城江机场','WDS' => '武当山机场');

/*
 * airline
 */
$config['airline'] = array('3U' => '四川航空','HU' => '海南航空','MF' => '厦门航空公司','G5' => '华夏航空','JD' => '首都航空','KA' => '港龙航空','GS' => '天津航空','TV' => '西藏航空','HO' => '上海吉祥航空公司','8L' => '祥鹏航空','DR' => '瑞丽航空','GJ' => '长龙航空','KY' => '昆明航空公司','DZ' => '东海航空公司','CA' => '中国国际航空公司','KN' => '联合航空','BK' => '奥凯航空','PN' => '西部航空','CZ' => '中国南方航空公司','MU' => '中国东方航空公司','OQ' => '重庆航空','CN' => '大新华航空','NS' => '河北航空','VD' => '鲲鹏航空','JR' => '幸福航空','9C' => '春秋航空','EU' => '成都航空','FM' => '上海航空','SC' => '山东航空','ZH' => '深圳航空','AQ' => '九元航空','YI'=>'英安航空','QW'=>'青岛航空','UQ'=>'乌鲁木齐','FU'=>'福州航空','GX'=>'北部湾航空','Y8'=>'扬子江快运航空','GY'=>'多彩贵州航空','RY'=>'江西航空','9H'=>'长安航空','A6'=>'红土航空','GT'=>'桂林航空');

/**
 * 支付宝
 */
$config['AliPay'] = array('AliPayPartner' => '2088711341846614', 'AliPayKey' => 'cme6twtfqkjud5b617nhigmkhpovmflf');

/**
 * 微信支付
 */
$config['WXPay'] = array(
    'appid' => 'wxf13d13b2ab2a3dd9',
    'mch_id' => '1335552101',
    'apikey' => '88987jhjhHJjh87KJiHJ098JHjh9887z',
    'appsecret' => '823fd6ab73ba14b4a0d1bbbf72fcefed',
    'sslcertPath' => '1335552101',
    'sslkeyPath' => 'wxa5d04e7035ba08c3'
    );

/**
 * 微信登录
 */
$config['wx'] = array(
    'WXLoginAppID' => 'wx27ba5fcb7ad07827',
    'WXLoginAppSecret' => '3e6d901f6ed55afdce05d7755edcfc3a',
    'WXAppLoginAppID' => 'wxa5d04e7035ba08c3',
    'WXAppLoginAppSecret' => '183cfbb8f28b3cd3d7377afd2cc1ae86'
    );

/**
 * 19易
 */
$config['19_yi'] = array('TrainAppID' => 'shenzhl', 
    'TrainAppID' => '301043',
	'TrainAppID_cheshi' => 'shenzhl',
    'TrainAppKey' => '1287674f448c017eafce0c3185e8079e', 
	'url' => 'http://118.244.193.38:18036/externalInterface.do',
	'TrainAppKey_cheshi' => 'bdb9846c609db4af23841c65fbbfcf9a', 
    'url_cheshi' => 'http://114.247.40.69:38055/externalInterface.do');

/**
 * 威富通
 */
$config['WeiFuTong'] = array('SPPayMCHID' => '101570000429', 
    'SPPayKey' => '477a70de191de671e0c3a70b0d0c4b30');


// 微信支付
$config['appid'] = 'wx4a86de4887a21961';
 
$config['mch_id'] = '1404535202';
 
$config['apikey'] = 'Fangwell98865918CNshenzhen4rtdfg';
 
$config['appsecret'] = "5048db5b1a1d2ad835316e46b39e6274";
 
//$config['sslcertPath'] =  APPPATH.'libraries/cert/apiclient_cert.pem';
$config['sslcertPath'] =  '/usr/local/apache/htdocs/wxpay/application/libraries/cert/apiclient_cert.pem';
 
//$config['sslkeyPath'] = APPPATH.'libraries/cert/apiclient_key.pem';
$config['sslkeyPath'] = '/usr/local/apache/htdocs/wxpay/application/libraries/cert/apiclient_key.pem';

/*
 * 火车席位类型
 */
$config['火车席位类型'] = array(0 => '商务座', 1 => '特等座', 2 => '一等座',
    3 => '二等座',
    4 => '高级软卧',
    5 => '软卧',
    6 => '硬卧',
    7 => '软座',
    8 => '硬座',
    9 => '无座',
    10 => '其他'
);
// 火车席位类型与19yi席位类型对应表
$config['火车席位19yi'] = array(0 => 'swz', 1 => 'tdz', 2 => 'rz1',
    3 => 'rz2',
    4 => 'gw',
    5 => 'rw',
    6 => 'yw',
    7 => 'rz',
    8 => 'yz',
    9 => 'wz'
);
/*
 * 火车订单状态
 */
$config['火车订单状态'] = array(0 => '待付款', 1 => '出票中', 2 => '已出票',
    3 => '退改中',
    4 => '已退票',
    5 => '已取消',
    6 => '支付超时',
    7 => '无法出票',
	8 => '出票失败，已退款'
);
/*
 * 火车退票订单状态
 */
$config['火车退票订单状态'] = array(0 => '退票待处理', 1 => '退票处理中', 2 => '退票失败',
    3 => '无法退票',
    4 => '退票成功，未退款',
    5 => '退票成功，已退款'
);
/*
 * 接口查询出票状态
 */
$config['火车出票状态'] = array(0 => 'BOOKING', 1 => 'BOOK_SUCCESS', 2 => 'OUT_SUCCESS',
    3 => 'OUT_FAIL',
);
/**
 * 酒店
 */
/* $config['去哪儿'] = array('Urlquna'=>'http://hdsoutlet.qunar.com/api/',
    'appKey'=>'12345678',
    'salt'=>'1397813103606',
    'secretKey'=>'abcdefg',
    'version'=>'3.1.0'
); */
$config['去哪儿'] = array('Urlquna'=>'http://api.hds.qunar.com/api/',
    'appKey'=>'10420847',
    // 'salt'=>'1397813103606',
    'secretKey'=>'bCKDsLfl',
    'version'=>'3.1.0'
);
/**
 * 酒店支付
 */
$config['酒店订单状态'] = array(0 => '已取消', 1 => '未支付', 2 => '已支付');

























































